{
  "title": "CODE_OF_CONDUCT.md",
  "text": "## [[Tags]]\n[[--- Documentacion]]\n\n```markdown\n# 🌿 CÓDIGO DE CONDUCTA – Dewey Pipeline\n\n**Versión 1.0 – Inspirado en la ética del conocimiento abierto**\n\n---\n\n## 🧭 Nuestro Compromiso\n\nComo miembros, contribuidor@s y líderes de este proyecto, nos comprometemos a hacer de la participación en **Dewey Pipeline** una experiencia libre de acoso para tod@s, sin importar edad, tamaño corporal, discapacidad visible o invisible, características sexuales, identidad y expresión de género, nivel de experiencia, educación, situación socioeconómica, nacionalidad, apariencia personal, raza, religión o identidad y orientación sexual.\n\nNos comprometemos a actuar e interactuar de formas que contribuyan a una comunidad abierta, acogedora, diversa, inclusiva y saludable.\n\n---\n\n## 🌱 Principios rectores\n\n### 📖 Conocimiento libre y con propósito\nValoramos el conocimiento como bien común. Promovemos su acceso, distribución ética y evolución colectiva.\n\n### 🧠 Respeto mutuo y diversidad cognitiva\nCelebramos distintos niveles de experiencia, culturas técnicas y estilos de aprendizaje. No hay preguntas “tontas”.\n\n### 🌐 Interdependencia comunitaria\nReconocemos que cada línea de código, comentario o test contribuye a un ecosistema más justo y accesible.\n\n### 🎨 Curiosidad y error como motor\nEl error no es fallo: es punto de partida. Fomentamos la experimentación, revisión y mejora continua.\n\n### 💬 Comunicación clara y cuidadosa\nEvitamos lenguaje agresivo, condescendiente o ambiguo. Buscamos claridad incluso en el disenso técnico.\n\n---\n\n## ✅ Comportamientos esperados\n\n- Mostrar empatía, respeto y amabilidad con l@s demás.\n- Escuchar activamente y dar feedback constructivo.\n- Reconocer errores y aprender de ellos.\n- Valorar y visibilizar el trabajo de otr@s.\n- Fomentar la inclusión en cada interacción.\n- Aportar desde el deseo de compartir, no de competir.\n\n---\n\n## 🚫 Comportamientos inaceptables\n\n- Cualquier forma de acoso, exclusión o burla.\n- Comentarios despectivos, insultos, trolling o violencia simbólica.\n- Publicar información privada de otr@s sin consentimiento.\n- Interrupciones no solicitadas, sabotaje técnico o emocional.\n- Represalias ante reportes de conducta inapropiada.\n\n---\n\n## 🛡️ Alcance\n\nEste código se aplica a todos los espacios del proyecto, incluyendo:\n\n- Repositorio de GitHub\n- Issues, Pull Requests y discusiones\n- Interacciones por redes sociales, eventos online u offline\n- Documentación, foros, talleres y otros canales vinculados\n\nTambién aplica a quienes representen formalmente al proyecto en dichos espacios.\n\n---\n\n## 🛠️ Cómo reportar una violación\n\nSi ves o experimentás algo que te incomoda o vulnera, escribinos a:\n\n📩 **conducta@dewey-pipeline.org** *(o al canal de contacto visible en el README)*\n\nTu reporte será tratado con **confidencialidad, seriedad y empatía**. Nadie será sancionado por reportar de buena fe.\n\n---\n\n## 🔄 Proceso de respuesta\n\nLos casos serán atendidos por l@s responsables del proyecto. Las acciones pueden incluir:\n\n1. 🤝 **Diálogo privado** con las partes involucradas\n2. ✋ **Advertencia formal** con sugerencia de cambio de comportamiento\n3. ⏸️ **Suspensión temporal** de participación en espacios del proyecto\n4. ❌ **Exclusión definitiva** en casos graves o reincidentes\n\n---\n\n## ✨ Compromiso\n\nEste código no es un muro, sino un suelo fértil. Lo usamos como guía viva para sostener un ecosistema donde el aprendizaje técnico y humano puedan florecer.\n\n> Si estás aprendiendo, enseñando o simplemente explorando, este espacio también es tuyo.  \n> Con respeto, curiosidad y colaboración, construimos junt@s.\n\n---\n\n_Adaptado del Contributor Covenant v2.0_  \nhttps://www.contributor-covenant.org/version/2/0/code_of_conduct.html\n\n```",
  "tags": "[[--- Documentacion]]",
  "type": "text/markdown",
  "created": "20250422015630454",
  "modified": "20250422015630454"
}